import styled from "styled-components";

const StyledImgWrapper = styled.section<{ $isEdit: boolean }>`
  display: flex;
  justify-content: space-between;
  align-items: flex-end;
  flex-direction: column;
  min-height: 6rem;
  margin-bottom: 0.7rem;

  ${({ $isEdit }) => $isEdit && `
    margin-bottom: 3rem;
  `}
`;

const StyledIconContainer = styled.div<{ $isDelete?: boolean }>`
  display: flex;
  justify-content: center;
  align-items: center;
  width: 2rem;
  height: 2rem;
  cursor: pointer;
  margin-top: ${({ $isDelete }) => ($isDelete ? "1rem" : "0")};
  color: ${({ theme }) => theme.color};
`;

interface ImgContainerProps {
  onClickEditTask: () => void;
  onClickDeleteTask: () => void;
  isEdit: boolean;
};

const ImgContainer = ({
  onClickEditTask,
  onClickDeleteTask,
  isEdit
}: ImgContainerProps) => {
  return (
    <StyledImgWrapper $isEdit={isEdit}>
      <StyledIconContainer onClick={onClickEditTask} title="Изменить описание">
        <svg
          xmlns="http://www.w3.org/2000/svg"
          width="1.5rem"
          height="1.5rem"
          viewBox="0 0 485.219 485.22"
          fill="currentColor"
          aria-label="Изменить задачу"
        >
          <path d="M467.476,146.438l-21.445,21.455L317.35,39.23l21.445-21.457c23.689-23.692,62.104-23.692,85.795,0l42.886,42.897
              C491.133,84.349,491.133,122.748,467.476,146.438z M167.233,403.748c-5.922,5.922-5.922,15.513,0,21.436
              c5.925,5.955,15.521,5.955,21.443,0L424.59,189.335l-21.469-21.457L167.233,403.748z M60,296.54c-5.925,5.927-5.925,15.514,0,21.44
              c5.922,5.923,15.518,5.923,21.443,0L317.35,82.113L295.914,60.67L60,296.54z M338.767,103.54L102.881,339.421
              c-11.845,11.822-11.815,31.041,0,42.886c11.85,11.846,31.038,11.901,42.914-0.032l235.886-235.837L338.767,103.54z
              M145.734,446.572c-7.253-7.262-10.749-16.465-12.05-25.948c-3.083,0.476-6.188,0.919-9.36,0.919
              c-16.202,0-31.419-6.333-42.881-17.795c-11.462-11.491-17.77-26.687-17.77-42.887c0-2.954,0.443-5.833,0.859-8.703
              c-9.803-1.335-18.864-5.629-25.972-12.737c-0.682-0.677-0.917-1.596-1.538-2.338L0,485.216l147.748-36.986
              C147.097,447.637,146.36,447.193,145.734,446.572z" />
        </svg>
      </StyledIconContainer>

      <StyledIconContainer onClick={onClickDeleteTask} title="Удалить задачу" $isDelete>
        <svg
          version="1.1"
          id="Capa_1"
          xmlns="http://www.w3.org/2000/svg"
          width="1.6rem"
          height="1.7rem"
          viewBox="0 0 791.908 791.908"
          enableBackground="new 0 0 791.908 791.908"
          xmlSpace="preserve"
          aria-label="Изменить задачу"
        >
          <g>
            <path
              d="M648.587,99.881H509.156C500.276,43.486,452.761,0,394.444,0S287.696,43.486,279.731,99.881H142.315
              c-26.733,0-48.43,21.789-48.43,48.43v49.437c0,24.719,17.761,44.493,41.564,47.423V727.64c0,35.613,28.655,64.268,64.268,64.268
              h392.475c35.613,0,64.268-28.655,64.268-64.268V246.087c23.711-3.937,41.564-23.711,41.564-47.423v-49.437
              C697.017,121.67,675.228,99.881,648.587,99.881z M394.444,36.62c38.543,0,70.219,26.733,77.085,63.261H316.351
              C324.225,64.268,355.901,36.62,394.444,36.62z M618.924,728.739c0,14.831-11.901,27.648-27.648,27.648H198.71
              c-14.831,0-27.648-11.901-27.648-27.648V247.185h446.948v481.554H618.924z M660.397,197.748c0,6.958-4.944,11.902-11.902,11.902
              H142.223c-6.958,0-11.902-4.944-11.902-11.902v-49.437c0-6.958,4.944-11.902,11.902-11.902h505.265
              c6.958,0,11.901,4.944,11.901,11.902v49.437H660.397z M253.09,661.45V349.081c0-9.887,7.873-17.761,17.761-17.761
              s17.761,7.873,17.761,17.761V661.45c0,9.887-7.873,17.761-17.761,17.761C260.964,680.309,253.09,671.337,253.09,661.45z
              M378.606,661.45V349.081c0-9.887,7.873-17.761,17.761-17.761c9.887,0,17.761,7.873,17.761,17.761V661.45
              c0,9.887-7.873,17.761-17.761,17.761C386.57,680.309,378.606,671.337,378.606,661.45z M504.212,661.45V349.081
              c0-9.887,7.873-17.761,17.761-17.761s17.761,7.873,17.761,17.761V661.45c0,9.887-7.873,17.761-17.761,17.761
              C513.093,680.309,504.212,671.337,504.212,661.45z"
              fill="currentColor"
            />
          </g>
        </svg>
      </StyledIconContainer>
    </StyledImgWrapper>
  );
};

export default ImgContainer;